<div class="container mt-5 mb-5">
<div class="row justify-content-center">
  <div class="col-sm-10 col-lg-6">
<h1 class="display-4"><?php echo $this->lang->line('client_signature'); ?></h1>
<p class="lead"></p>
</div></div>
<div class="row justify-content-center">
<div class="col-sm-10 col-lg-6">
<p>Έχω διαβάσει και αποδέχομαι τους Όρους Ελέγχου Οχημάτων <button type="button" class="btn btn-primary btn-sm" data-toggle="modal" data-target="#exampleModalLong">εμφάνιση</button></p>
<?php 
$attributes = array('id' => 'clientForm');
echo form_open("inspection/getsignature", $attributes);?>
<input type="hidden" name ="id_client" value ="<?= $id_client ?>">
<input type="hidden" id="inspectionid" name="inspectionid" value="<?= $inspectionid ?>">
<!--<div class="form-group">
  <label for=""></label>
  <input type="text" name="" id="" class="form-control" placeholder="" aria-describedby="helpId">
  <small id="helpId" class="text-muted">Help text</small>
</div> -->
<div class="form-row">
        <div class="form-group col">
            <label for="firstname_client"><?= $this->lang->line('firstname_client'); ?></label>
            <input type="text" class="form-control" id="firstname_client" name ="firstname_client" value ="<?= $firstname_client ?>">
        </div>
        <div class="form-group col">
            <label for="lastname_client"><?= $this->lang->line('lastname_client'); ?></label>
            <input type="text" class="form-control" id="lastname_client" name ="lastname_client" value ="<?= $lastname_client ?>">
        </div>
    </div>
	<div class="form-group">
  <label for="">Υπογραφή</label>
	<canvas id="signature-pad" class="signature-pad" width=350 height=200></canvas>
    <input type="hidden" id="signature-input" name="signature">
	<button id="clear">Clear</button>
	</div>
<button type="submit" class="btn btn-primary">Καταχώρηση</button>
<?php echo form_close();?>
</div>
</div></div>

<div class="modal fade" id="exampleModalLong" tabindex="-1" role="dialog" aria-labelledby="exampleModalLongTitle" aria-hidden="true">
  <div class="modal-dialog" role="document">
    <div class="modal-content">
      <div class="modal-header">
        <h5 class="modal-title" id="exampleModalLongTitle">ΟΡΟΙ ΕΛΕΓΧΩΝ ΟΧΗΜΑΤΩΝ </h5>
        <button type="button" class="close" data-dismiss="modal" aria-label="Close">
          <span aria-hidden="true">&times;</span>
        </button>
      </div>
      <div class="modal-body">
        <h4>ΕΙΣΑΓΩΓΙΚΑ</h4>
		<p>Η εταιρεία Ιmperial DEKRA διαθέτοντας υψηλή τεχνογνωσία και εξειδίκευση διενεργεί κατόπιν αιτήσεων ελέγχους σε παντός είδους οχήματα. Οι έλεγχοι της διέπονται από συγκεκριμένους όρους και προϋποθέσεις οι οποίες αναφέρονται αναλυτικά στο παρόν έγγραφο. </p>
		<p>Οι κάτωθι όροι ισχύουν σε κάθε περίπτωση ανάθεσης ελέγχου οχήματος από πελάτη στην εταιρεία με την επωνυμία Ιmperial DEKRA. Με την εκδήλωση ενδιαφέροντος από τον πελάτη και την αίτησή του για έλεγχο η ως άνω εταιρεία του γνωστοποιεί τους κάτωθι όρους και ο τελευταίος τους αποδέχεται με την υπογραφή του στο τέλος του εγγράφου αναγράφοντας ολογράφως και το ονοματεπώνυμό του. Η γνωστοποίηση και η αποδοχή των όρων δύναται να γίνεται και ηλεκτρονικά δηλώνοντας ο πελάτης τη διεύθυνση email στην ως άνω εταιρεία στην οποία επιθυμεί να λάβει το κείμενο των όρων. Η αποστολή των όρων στην υποδειχθείσα διεύθυνση αποτελεί αποδοχή από πλευράς του πελάτη. Οι κάτωθι όροι γνωστοποιούνται σε κάθε ενδιαφερόμενο πελάτη μέσω του διαδικτυακού τόπου της εταιρείας.</p>
		<h4>1. Υποχρέωση Ενημέρωσης</h4>
		<p>Ο ιδιοκτήτης ή κάτοχος του οχήματος, εφεξής «Πελάτης», ο οποίος αιτείται από την Imperial DEKRA,  εφεξής «Πάροχος» και της δίνει εντολή για επιθεώρησή όπως και ο αντιπρόσωπός του, οφείλει τηρώντας τους κανόνες της καλής πίστης να υποβοηθήσει τον εντεταλμένο ελεγκτή από τον πάροχο στο έργο της αξιολόγησης του οχήματος του με αντικειμενικότητα και διαφάνεια.</p>
		<p>Για την εκπλήρωση αυτού του σκοπού ο πελάτης υποχρεούται να παραθέτει στον εντεταλμένο ελεγκτή / επιθεωρητή, όλα τα διαθέσιμα έγγραφα του υπό επιθεώρηση οχήματος όπως ενδεικτικά: το Βιβλίο Συντήρησης και Βλαβών (book service) του, έγκυρη άδεια κυκλοφορίας οχήματος, ασφαλιστήριο, και να αναφέρει χωρίς πρόθεση απόκρυψης όλες τις ουσιώδεις για τον έλεγχο του οχήματος πληροφορίες που γνωρίζει, όπως τυχόν προγενέστερες ζημίες του οχήματος, τις τυχόν βλάβες που το όχημα ήδη παρουσιάζει, πιθανή αλλοίωση του χιλιομετρητή του και να θέτει σε γνώση του προφορικώς ή και εγγράφως, αποτελέσματα προηγούμενων ελέγχων του συγκεκριμένου οχήματος από τον ίδιο ή από άλλο ελεγκτικό φορέα ή επίσημη αντιπροσωπεία, αν υπάρχουν τέτοια.</p>
		<h4>2. Μηχανολογικός έλεγχος, συστήματος διεύθυνσης, test drive</h4>
		<p>Ο Πελάτης (ιδιοκτήτης ή κάτοχος) του οχήματος, ο οποίος αιτείται την επιθεώρηση όπως και ο αντιπρόσωπός του υποχρεούται να επιτρέπει στον εντεταλμένο επιθεωρητή του παρόχου, το δικαίωμα, να θέτει σε λειτουργία τον κινητήρα του οχήματος για να ελέγχει το σύστημα διεύθυνσης του οχήματος σε κίνηση, να ελέγχει το κάτω μέρος του οχήματος και στη περίπτωση που το κρίνει απαραίτητο, να διεξάγει test drive. Το test drive δεν περιλαμβάνεται σε όλες τις υπηρεσίες ελέγχου που διεξάγει ο πάροχος. </p>
		<p>Σε περίπτωση που ο έλεγχος αφορά σε έλεγχο ορθότητας μιας επισκευής, ο πελάτης οφείλει να τον ενημερώσει για τον τρόπο που διεξήχθη η επισκευή με σκοπό να αξιολογήσει τη ποιότητά της.</p>
		<p>Σε περίπτωση που για οποιονδήποτε λόγο δεν καταστεί δυνατό για τον ελεγκτή να διενεργήσει τα ως άνω, η αίτηση παροχής της υπηρεσίας ελέγχου θα απορριφθεί και ο πελάτης αναγνωρίζει ότι οφείλει στον πάροχο το ποσό των εξόδων μετάβασης κατέβαλε ο τελευταίος.</p>
		<h4>3. Κατάσταση Οχήματος κατά την επιθεώρηση</h4>
		<p>Ο πελάτης θα πρέπει να θέσει το όχημα στη διάθεση στον εντεταλμένο ελεγκτή του παρόχου καθαρό. Εάν για λόγους ανωτέρας βίας (π,χ καιρικών συνθηκών), το όχημα δεν παρουσιαστεί καθαρό, αυτό θα αναφέρεται στην έκθεση ελέγχου. </p>
		<p>Στην τελευταία περίπτωση ο πελάτης χωρίς υπαιτιότητά του μπορεί να οδηγηθεί σε ανακριβή αποτελέσματα για τη κατάσταση κάποιων μερών του οχήματος κατά τον έλεγχό του και ο πελάτης, αποδέχεται αυτό το ενδεχόμενο και δυνάμει αυτής της αποδοχής παραιτείται του δικαιώματος να αξιώσει οποιαδήποτε επιστροφή του καταβληθέντος τιμήματος ελέγχου.</p>
		<h4>4. Χρήση συσκευών / εργαλείων που έχουν κατασκευαστεί από τρίτους παρόχους ή που φέρουν λογισμικό τρίτων παρόχων</h4>
		<p>Ο πάροχος, προκειμένου να προσφέρει την υπηρεσία επιθεώρησης ή/και ελέγχου, χρησιμοποιεί συσκευές ή λογισμικό που έχουν αναπτύξει τρίτοι πάροχοι ή συσκευές που έχουν αναπτύξει τρίτοι πάροχοι και φέρουν λογισμικό της ίδιας ή των συνεργατών της ενδεικτικά, συσκευή διάγνωσης εγκεφάλου (ECU OBD), συσκευή διάγνωσης κατάστασης μπαταρίας, μετρητή πάχους βαφής, τάση ελέγχου μπαταρίας, βάθος πέλματος ελαστικών. </p>
		<p>Η Imperial Automotive ή και οι εντεταλμένοι συνεργάτες της, δεν φέρουν καμία ευθύνη για την τυχόν ανακρίβεια των αποτελεσμάτων που εξάγονται από τέτοιες συσκευές ή λογισμικά εκτός εάν η χρήση των ως άνω συσκευών και λογισμικών γίνεται κατά λανθασμένο τρόπο ή έλαβε γνώση της ανακρίβειας αυτής (βλέπε όρο 3). </p>
		<h4>5. Ευθύνη</h4>
		<p>Ο πάροχος, κατά την επιθεώρηση διενεργεί μόνον οπτικούς, ηλεκτρονικούς και λειτουργικούς ελέγχους. Αυτοί οι έλεγχοι διενεργούνται σύμφωνα με όλους τους κοινούς παραδεδεγμένους κανόνες της μηχανολογίας ενώ σε καμία περίπτωση δεν συνιστούν πλήρη έλεγχο. Ο πάροχος ούτε αποσυναρμολογεί το όχημα κατά τρόπο για να δύναται να εγγυάται για την ακρίβεια των ευρημάτων της και τον συσχετισμό τους με μη ελεγχθέντα μέρη του αυτοκινήτου. Δεδομένων των ανωτέρω ο πάροχος, δεν φέρει καμία ευθύνη για την ορθότητα, περιεχόμενο και πληρότητα των ευρημάτων του, τα οποία εξάγονται με επιφύλαξη καθώς δεν διεξάγεται πλήρης έλεγχος.</p>

		<p>Τα αποτελέσματα που εξάγονται συνιστούν απλώς πληροφορία για τη κατάσταση του οχήματος κατά τη συγκεκριμένη στιγμή (ώρα και ημέρα) που διενεργείται ο έλεγχος και όπως είναι αυτονότητο αυτά μπορεί να μεταβληθούν ανά πάσα στιγμή μετά τον έλεγχο ακόμα και ουσιωδώς είτε λόγω φυσιολογικής φθοράς είτε λόγω ακινησίας είτε λόγω αμέλειας του οδηγού, κακής μεταχείρισης ή πλημμελούς συντήρησης ή επισκευής είτε λόγω εξωτερικών παραγόντων (καιρικών ή ατυχήματος).</p>

		<p>Κατά συνέπεια με ο έλεγχος του παρόχου δεν παρέχει κάποιου είδους εγγύηση ή εξασφάλιση σε τρίτον π.χ. σε έναν υποψήφιο αγοραστή του αυτοκινήτου και δεν φέρει καμία ευθύνη για οτιδήποτε προκύψει μετά το πέρας του ελέγχου της. Τα ως άνω ισχύουν και για την υπηρεσία αξιολόγησης ορθής επισκευής που έχει γίνει σε επισκευασμένο όχημα.</p>
		<p>Ο πελάτης, σε περίπτωση που μεταπωλήσει το όχημα αναφέροντας στον αγοραστή τα ευρήματα του ελέγχου του παρόχου, οφείλει με τη σειρά του να ενημερώσει τον αγοραστή για τους όρους διενέργειας του ελέγχου και ότι αυτός δεν συνιστά πλήρη έλεγχο και απαγορεύεται να ισχυριστεί ή να αφήσει να εννοηθεί ότι ο έλεγχος του παρόχου αποτελεί οποιουδήποτε είδους εγγύηση για την αξιοπιστία και καταλληλότητα του προς πώληση οχήματος.</p>
		<h4>6. Δήλωση Ανεξαρτησίας και Αντικειμενικότητας</h4>
		<p>Ο πάροχος δηλώνει, ότι δεν σχετίζεται καθ΄ οιονδήποτε τρόπο έχει με την εμπορία και πώληση μεταχειρισμένων οχημάτων ή με την επισκευή ζημιωθέντων οχημάτων. Ως εκ τούτου, ουδέν συμφέρον έχει, (οικονομικό ή άλλο, άμεσο ή έμμεσο) από την πώληση ή επισκευή των ελεγχθέντων οχημάτων ή από την πώληση ή επισκευή άλλων οχημάτων.</p>
		<p>Ο έλεγχος του παρόχου υπακούει στους κανόνες της αντικειμενικότητας, της διαφάνειας και της αμεροληψίας. Ο πελάτης, σε περίπτωση που υποπέσει στην αντίληψή του ότι οποιοσδήποτε εκπρόσωπος του παρόχου (ελεγκτής, ή άλλος) ασχολείται έναντι ανταλλάγματος με τη πώληση ή επισκευή οχημάτων, οφείλει αμέσως, να ενημερώσει τον πάροχο.</p>
		<h4>7. Προωθητικές ενέργειες Πελάτη</h4>
		<p>Ο Πελάτης, έχει το δικαίωμα να πληροφορήσει τρίτους για τη συνεργασία του με τον πάροχο καθώς  και να διαθέτει τις εκθέσεις ελέγχου του με το ακριβές περιεχόμενό τους, ως προωθητικά μέσα πώλησης οχημάτων. Απαγορεύεται όμως, να αλλοιώνει τα σήματα της Imperial Automotive και της DEKRA, τη γραμματοσειρά τους, το χρώμα τους ή το περιεχόμενο των ευρημάτων τους ή να τα χρησιμοποιεί κατά τρόπο παραπλανητικό. </p>
		<p>Παραπλανητικός τρόπος θεωρείται ιδίως, όταν ο πελάτης δεν ενημερώνει τους τρίτους με ακρίβεια για το είδος του ελέγχου που πράγματι έγινε. Ενώ π.χ διενεργήθηκε μόνο μέτρηση πάχους βαφής στο όχημα, επιπρόσθετα επικαλείται ότι διενεργήθηκε και διαγνωστικός έλεγχος εγκεφάλου ή ότι ενώ διενεργήθηκε μόνο διαγνωστικός έλεγχος εγκεφάλου, ο πελάτης να αναφέρει παραπλανητικά ότι το αυτοκίνητο πιστοποιήθηκε πλήρως από τη DEKRA φέροντας τη σφραγίδα της ή παραπλανητικά να αναφέρει ότι διενεργήθηκε και test drive χωρίς κάτι τέτοιο να έχει συμβεί. Στη περίπτωση αυτή, ο πελάτης οφείλει αποζημίωση στο πάροχο και αποτελεί λόγο άμεσης διακοπής της συνεργασίας τους.</p>
		<p>Σε περίπτωση που ο πάροχος, αποφασίσει να σταματήσει την συνεργασία του ή παύσει για οποιοδήποτε λόγο η συνεργασία του με τον πελάτη, αυτό θα είναι αζημίως εκατέρωθεν και ο τελευταίος, υποχρεούται να σταματήσει την πληροφόρηση για τη συνεργασία τους</p>
		<h4>8. Προωθητικές ενέργειες Imperial Automotive </h4>
		<p>Ο πάροχος, έχει τη δυνατότητα να προβεί σε προωθητικές ενέργειες που ενισχύουν τη φήμη της στον έλεγχο μεταχειρισμένων ή επισκευασμένων οχημάτων και που βοηθούν τους πελάτες της (εμπόρους ή ιδιώτες) να προωθήσουν με μεγαλύτερη ευκολία και τίμημα τα προς πώληση οχήματά τους.</p>
		<p>Προς το σκοπό αυτό, η Imperial Automotive έχει το δικαίωμα στην ιστοσελίδα της ή σε κάθε είδους διαφημιστικά μέσα (έντυπα ή ηλεκτρονικά), να παραθέσει τα στοιχεία των ελεγχθέντων οχημάτων της, το τόπο πώλησής τους καθώς και τα αποτελέσματα των ελέγχων της, με σκοπό να τον ενισχύσει διαφημιστικά στη προσπάθεια πώλησης των οχημάτων του. Εφόσον όμως ο πελάτης-πωλητής ζητήσει να σταματήσει η έκθεση κάποιου συγκεκριμένου ή όλων των οχημάτων του από κάποιο προωθητικό μέσο, ο πάροχος, οφείλει να το πράξει αμέσως.   </p>
		<p>Σε καμία όμως περίπτωση, ο πάροχος, ή κάποιος εκπρόσωπός του, δεν μπορεί να ζητήσει για την προωθητική αυτή υπηρεσία οποιοδήποτε είδους οικονομικό αντάλλαγμα (προμήθεια, αμοιβή ή άλλο) από τους πελάτες του, θέτοντας υπό αμφισβήτηση την αντικειμενικότητα των ελέγχων του.</p>
		<p>Ο πελάτης δηλώνει ότι έλαβε γνώση των όρων ελέγχου οχημάτων όπως αναγράφονται ανωτέρω και δηλώνει ανεπιφύλακτα την αποδοχή τους. Οι ως άνω όροι, θα είναι αναρτημένοι στην ιστοσελίδα του παρόχου www.imperial-dekra.gr από όπου ο πελάτης θα ενημερώνεται για οποιαδήποτε μεταβολή τους.</p>
		<p>Στην περίπτωση που ο πελάτης είναι έμπορος οχημάτων και συνεργάζεται με την εταιρεία για τον έλεγχο οχημάτων δεν απαιτείται η υπογραφή του παρόντος ανά έλεγχο οχήματος καθώς οι όροι του παρόντος εφόσον έχουν γνωστοποιηθεί στον έμπορο άπαξ θα ισχύουν για κάθε έλεγχο. Οι ως άνω όροι, θα είναι αναρτημένοι στην ιστοσελίδα του παρόχου www.imperial-dekra.gr από όπου ο πελάτης θα ενημερώνεται για οποιαδήποτε μεταβολή τους.</p>

		      </div>
      <div class="modal-footer">
        <button type="button" class="btn btn-secondary" data-dismiss="modal">Κλείσιμο</button>
      </div>
    </div>
  </div>
</div>




<script src="https://cdnjs.cloudflare.com/ajax/libs/signature_pad/1.5.3/signature_pad.min.js"></script>

<script>
var canvas = document.querySelector("canvas");
var signaturePad = new SignaturePad(canvas);

canvas.addEventListener("mouseup", function () {
    document.getElementById("signature-input").value = signaturePad.toDataURL();
});

document.getElementById('clear').addEventListener('click', function () {
  signaturePad.clear();
});
</script>

